#include <iostream>
#include <cmath>

#include <windows.h>
#include <conio.h>

using namespace std;

//!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

double FuncY(double x) //функція
{
    return ( pow(x, 5) * pow( cos(1.0 / x), 2) );
}

//|||||||||||||||||||||||||||||||||||||||||||||||||||||
//|||||||||||||||||||||||||||||||||||||||||||||||||||||
//|||||||||||||||||||||||||||||||||||||||||||||||||||||

int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    double x, y;
    cout << "Ведіть x: ";
    cin >> x; 
    cout << "Ведіть y: ";
    cin >> y; 

    double A = ( pow(FuncY(x), 2) + pow(FuncY(y), 2) ) / 2;

    cout << "Значення виразу A: " << A << "\n";

    getch();

    return 0;
}

//|||||||||||||||||||||||||||||||||||||||||||||||||||||
//|||||||||||||||||||||||||||||||||||||||||||||||||||||
//|||||||||||||||||||||||||||||||||||||||||||||||||||||